-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Admin\Dropbox\My PC (DESKTOP-9MD6Q97)\Documents\obesity-elevation\src\data-cleaning\nlsy\append_all.log
  log type:  text
 opened on:  17 Mar 2023, 15:40:43

. 
. global cln_c79 "../../../data/nlsy/cleaned/c79/"

. global cln_y79 "../../../data/nlsy/cleaned/y79/"

. global cln_y97 "../../../data/nlsy/cleaned/y97/"

. global cln_ovr "../../../data/nlsy/cleaned/"

. 
. **************************************************
. * Append all three cohorts together
. **************************************************
. 
. use          ${cln_y79}master.dta, clear

. append using ${cln_y97}master.dta, generate(cohortFlag)
(label vl_nutrition already defined)

. recode  cohortFlag (0 = 1979) (1 = 1997)
(381852 changes made to cohortFlag)

. lab var cohortFlag "Cohort Flag (1979 or 1997)"

. append using ${cln_c79}master.dta
(variable id was int, now float to accommodate using data's values)
(variable height was byte, now float to accommodate using data's values)
(label vl_race already defined)

. tab cohortFlag, mi

 Cohort Flag (1979 |
          or 1997) |      Freq.     Percent        Cum.
-------------------+-----------------------------------
              1979 |    234,998       51.54       51.54
              1997 |    146,854       32.21       83.75
                 . |     74,116       16.25      100.00
-------------------+-----------------------------------
             Total |    455,968      100.00

. 
. generat cohort = ""
(455,968 missing values generated)

. replace cohort = "NLSY79" if cohortFlag==1979
variable cohort was str1 now str6
(234,998 real changes made)

. replace cohort = "NLSY97" if cohortFlag==1997
(146,854 real changes made)

. replace cohort = "NLSY79 Children" if cohortFlag==.
variable cohort was str6 now str15
(74,116 real changes made)

. drop cohortFlag

. tab cohort

         cohort |      Freq.     Percent        Cum.
----------------+-----------------------------------
         NLSY79 |    234,998       51.54       51.54
NLSY79 Children |     74,116       16.25       67.79
         NLSY97 |    146,854       32.21      100.00
----------------+-----------------------------------
          Total |    455,968      100.00

. 
. order cohort id year id_moth age weight* height* hgc

. 
. tab age cohort, sum(bmi) mean

                               Means of bmi

 AGE AS OF |            cohort
     JAN 1 |    NLSY79  NLSY79 ..     NLSY97 |     Total
-----------+---------------------------------+----------
        -8 |         .  22.558145          . | 22.558145
        -7 |         .  22.519333          . | 22.519333
        -6 |         .   22.41149          . |  22.41149
        -5 |         .  23.202165          . | 23.202165
        -4 |         .  22.351784          . | 22.351784
        -3 |         .   23.49712          . |  23.49712
        -2 |         .  22.345205          . | 22.345205
        -1 |         .  23.495822          . | 23.495822
         0 |         .  22.396823          . | 22.396823
         1 |         .  23.217271          . | 23.217271
         2 |         .   22.50076          . |  22.50076
         3 |         .  23.026513          . | 23.026513
         4 |         .  22.486795          . | 22.486795
         5 |         .  22.639037          . | 22.639037
         6 |         .  22.414586          . | 22.414586
         7 |         .   22.62031          . |  22.62031
         8 |         .  22.322969          . | 22.322969
         9 |         .  22.366867          . | 22.366867
        10 |         .  22.182776          . | 22.182776
        11 |         .  22.696835          . | 22.696835
        12 |         .  22.642658          . | 22.642658
        13 |         .  22.727551  21.936707 | 22.095977
        14 |         .  22.911738  22.669297 | 22.797301
        15 |         .  23.367668  23.233741 | 23.289182
        16 |  21.80146  23.876083  23.588989 | 23.512093
        17 | 22.037493  24.146042  24.110833 |  23.76608
        18 | 22.434086  24.696012  24.552757 | 24.076166
        19 | 22.728828  25.008635  25.010328 | 24.316056
        20 |  23.02981    25.4999   25.47618 | 24.632838
        21 | 23.297643  25.843967  25.813839 | 24.841022
        22 | 23.569959  26.329735  26.150956 | 25.113069
        23 | 23.833245  26.677144  26.442209 | 25.320886
        24 | 24.107289  26.976667  26.672577 | 25.591708
        25 | 24.412721   27.29312  27.002488 | 25.888669
        26 | 24.725608  27.640122  27.228623 | 26.175769
        27 | 25.048322  27.826961  27.488374 | 26.328327
        28 | 25.347758  28.278435  27.613756 | 26.585991
        29 | 25.596336   28.45846  27.888407 | 26.682059
        30 | 25.775973  29.165953  27.999866 |  26.67252
        31 | 26.054718  29.402456  28.158417 |  26.73608
        32 | 26.213372  29.305698    28.3262 | 27.385321
        33 | 26.461177  29.170547  28.424287 | 27.392377
        34 | 26.560545  32.212463  28.605296 | 27.518597
        35 | 26.936992  31.428228  28.676072 | 27.585116
        36 | 27.133197  30.102291  28.852623 | 28.083121
        37 | 27.461071  29.977986  28.767473 | 28.034106
        38 | 27.481505  32.371623  29.001978 | 27.832808
        39 | 27.762849  30.330231          . |   27.7714
        40 | 27.765505  30.148705          . | 27.918168
        41 |   28.0157  30.534547          . | 28.111064
        42 | 28.008756          .          . | 28.008756
        43 | 28.264329          .          . | 28.264329
        44 | 28.302609  33.890499          . |  28.33184
        45 | 28.515438  30.047226          . | 28.518097
        46 | 28.502794          .          . | 28.502794
        47 | 28.773895          .          . | 28.773895
        48 |  28.79555          .          . |  28.79555
        49 | 28.984848          .          . | 28.984848
        50 | 28.985248          .          . | 28.985248
        51 |  29.15853          .          . |  29.15853
        52 | 29.180763          .          . | 29.180763
        53 | 29.204974          .          . | 29.204974
        54 | 29.199843          .          . | 29.199843
        55 | 29.218952          .          . | 29.218952
        56 | 29.226314          .          . | 29.226314
        57 | 29.349965          .          . | 29.349965
        58 | 29.182947          .          . | 29.182947
        59 | 28.920459          .          . | 28.920459
        60 | 29.028261          .          . | 29.028261
-----------+---------------------------------+----------
     Total | 26.126369  25.173335  26.204837 | 25.975325

. 
. save ${cln_ovr}combined.dta, replace
file ../../../data/nlsy/cleaned/combined.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\Admin\Dropbox\My PC (DESKTOP-9MD6Q97)\Documents\obesity-elevation\src\data-cleaning\nlsy\append_all.log
  log type:  text
 closed on:  17 Mar 2023, 15:40:49
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
